LJMP     C:0029             //¼ì²â°´¼üK1ÊÇ·ñ°´ÏÂ   
JB       k1(0x90.7),C:0015//Ïû³ý¶¶¶¯ Ò»°ã´óÔ¼10ms
MOV      R7,#0xE81000   //Ïû³ý¶¶¶¯ Ò»°ã´óÔ¼10ms 
MOV      R6,#0x031000   //Ïû³ý¶¶¶¯ Ò»°ã´óÔ¼10ms
LCALL    delay(C:0035)
JB       k1(0x90.7),C:0012  //ÔÙ´ÎÅÐ¶Ï°´¼üÊÇ·ñ°´ÏÂ
CPL      led(0xA0.0)ed=~led;         //led×´Ì¬È¡·´
JNB      k1(0x90.7),C:0012  //¼ì²â°´¼üÊÇ·ñËÉ¿ª ¡·´ 
JB       k2(0xB0.0),main(C:0003)
MOV      R7,#0xE81000   //Ïû³ý¶¶¶¯ Ò»°ã´óÔ¼10ms 
MOV      R6,#0x031000   //Ïû³ý¶¶¶¯ Ò»°ã´óÔ¼10ms
LCALL    delay(C:0035);   //Ïû³ý¶¶¶¯ Ò»°ã´óÔ¼10ms
JB       k2(0xB0.0),C:0024  //ÔÙ´ÎÅÐ¶Ï°´¼üÊÇ·ñ°´ÏÂ
CPL      led(0xA0.0)ed=~led;         //led×´Ì¬È¡·´
JB       k2(0xB0.0),main(C:0003)     //led×´Ì¬È¡·´
SJMP     C:0024
         
MOV      R0,#0x7F0,main(C:0003)     //led×´Ì¬È¡·´ 
CLR      A		 
MOV      @R0,A	 
DJNZ     R0,C:002C,main(C:0003)     //led×´Ì¬È¡·´ 		 
MOV      SP(0x81),#0x07n(C:0003)     //led×´Ì¬È¡·´ 
LJMP     main(C:0003)07n(C:0003)     //led×´Ì¬È¡·´ 
MOV      A,R7(C:0003)07n(C:0003)     //led×´Ì¬È¡·´ 		 
DEC      R7R7(C:0003)07n(C:0003)     //led×´Ì¬È¡·´ 	 
MOV      R4,0x06000307n(C:0003)     //led×´Ì¬È¡·´ 	 
JNZ      C:003C6000307n(C:0003)     //led×´Ì¬È¡·´ 	 
DEC      R6003C6000307n(C:0003)     //led×´Ì¬È¡·´ 	 
ORL      A,R43C6000307n(C:0003)     //led×´Ì¬È¡·´ 	 
JNZ      delay(C:0035)7n(C:0003)     //led×´Ì¬È¡·´ 	 
RET      delay(C:0035)7n(C:0003)     //led×´Ì¬È¡·´  
		 
		 
		 
		 
END		   